app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def create

    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Title 2"], ["body", "Dummy text 2 blah"], ["created_at", "2016-03-14 17:42:33.620640"], ["updated_at", "2016-03-14 17:42:33.620640"]]

  def show
    @article = Article.find(params[:id]) #finds the specific character by id number
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]